<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introduction</a></span><ul class="toc-item"><li><span><a href="#Problem-Statement" data-toc-modified-id="Problem-Statement-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Problem Statement</a></span></li><li><span><a href="#Background" data-toc-modified-id="Background-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Background</a></span></li></ul></li><li><span><a href="#Data-Preparation" data-toc-modified-id="Data-Preparation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Data Preparation</a></span><ul class="toc-item"><li><span><a href="#Data-provided" data-toc-modified-id="Data-provided-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Data provided</a></span><ul class="toc-item"><li><span><a href="#Data-reading" data-toc-modified-id="Data-reading-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Data reading</a></span></li><li><span><a href="#Data-cleaning" data-toc-modified-id="Data-cleaning-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Data cleaning</a></span></li></ul></li><li><span><a href="#Additional-data" data-toc-modified-id="Additional-data-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Additional data</a></span><ul class="toc-item"><li><span><a href="#Web-scraping" data-toc-modified-id="Web-scraping-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>Web scraping</a></span></li><li><span><a href="#Data-cleaning" data-toc-modified-id="Data-cleaning-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>Data cleaning</a></span></li></ul></li></ul></li><li><span><a href="#Visualisations-and-Insights" data-toc-modified-id="Visualisations-and-Insights-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Visualisations and Insights</a></span><ul class="toc-item"><li><span><a href="#Movie-industry-trends" data-toc-modified-id="Movie-industry-trends-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Movie industry trends</a></span></li><li><span><a href="#Impact-of-budget" data-toc-modified-id="Impact-of-budget-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Impact of budget</a></span></li><li><span><a href="#Which-genre?" data-toc-modified-id="Which-genre?-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Which genre?</a></span></li><li><span><a href="#Runtime" data-toc-modified-id="Runtime-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Runtime</a></span></li><li><span><a href="#Release-date" data-toc-modified-id="Release-date-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>Release date</a></span></li><li><span><a href="#Exploring-franchises" data-toc-modified-id="Exploring-franchises-3.6"><span class="toc-item-num">3.6&nbsp;&nbsp;</span>Exploring franchises</a></span></li></ul></li><li><span><a href="#Conclusion-and-Future-Work" data-toc-modified-id="Conclusion-and-Future-Work-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Conclusion and Future Work</a></span></li></ul></div>

<b>Final Project Submission</b>

Please fill out:
* Student name: Nadine Amersi-Belton
* Student pace: part time
* Scheduled project review date/time: TBC
* Instructor name: TBC
* Blog post URL: TBC

# Introduction

## Problem Statement

## Background

# Data Preparation

In [1]:
# We will begin by importing the necessary packages.

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sqlite3
from glob import glob
from bs4 import BeautifulSoup
import requests

%matplotlib inline

## Data provided

### Data reading

In [2]:
# Create a list of all csv files using glob
csv_files = glob("./zippedData/*.csv.gz")
csv_files

['./zippedData/imdb.title.crew.csv.gz',
 './zippedData/tmdb.movies.csv.gz',
 './zippedData/imdb.title.akas.csv.gz',
 './zippedData/imdb.title.ratings.csv.gz',
 './zippedData/imdb.name.basics.csv.gz',
 './zippedData/imdb.title.basics.csv.gz',
 './zippedData/tn.movie_budgets.csv.gz',
 './zippedData/bom.movie_gross.csv.gz',
 './zippedData/imdb.title.principals.csv.gz']

In [3]:
# Create a dictionary of DataFrames
csv_dict = {}
for file in csv_files:
    filename = file.split('zippedData/')[1].replace(".csv.gz", "").replace(".", "_") #clean filename
    file_df = pd.read_csv(file) #create dataframe
    csv_dict[filename] = file_df #insert dataframe into dictionary with key = filename

In [4]:
# Preview the data
for name, df in csv_dict.items():
    print(name)
    display(df.head()) #using display instead of print leads to neater formatting in Jupyter Notebook
    print("------------------ \n")

imdb_title_crew

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

------------------

tmdb_movies

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

------------------

imdb_title_akas

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

------------------

imdb_title_ratings

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

------------------

imdb_name_basics

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

------------------

imdb_title_basics

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

------------------

tn_movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

------------------

bom_movie_gross

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

------------------

imdb_title_principals

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

------------------

In [5]:
# Do the same for tsv files
tsv_files = glob("./zippedData/*.tsv.gz")
tsv_files

['./zippedData/rt.reviews.tsv.gz', './zippedData/rt.movie_info.tsv.gz']

In [6]:
# Create a dictionary of DataFrames
tsv_dict = {}
for file in tsv_files:
    filename = file.split('zippedData/')[1].replace(".tsv.gz", "").replace(".", "_") #clean filename
    file_df = pd.read_table(file, delimiter = '\t', encoding = 'latin-1') #create dataframe
    tsv_dict[filename] = file_df #insert dataframe into dictionary with key = filename

In [7]:
# Preview the data
for name, df in tsv_dict.items():
    print(name)
    display(df.head()) #using display instead of print leads to neater formatting in Jupyter Notebook
    print("------------------ \n")

rt_reviews

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

------------------

rt_movie_info

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

------------------

<p style="color:red">TBD: Conclusion: Which DFs to study/ questions to look into</p>

### Data cleaning

Look at tn_movie_budgets dataframe as it has budget as well as gross.

In [8]:
#tn_movie_budgets as tnmb
tnmb = csv_dict['tn_movie_budgets']
tnmb.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [9]:
tnmb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [10]:
# Remove id column
tnmb = tnmb.drop('id', axis = 1)
tnmb.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [11]:
#select year from release_date and convert to int
tnmb['release_date']=tnmb['release_date'].map(lambda x: int(x[-4:]))
tnmb.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,2009,Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2011,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,2019,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,2015,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,2017,Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [12]:
# define function to clean numbers
def intnum(df,col):
    df[col]=df[col].str.replace("$","").str.replace(",","").astype('int')
    return df

In [13]:
# Run function on the three columns
intnum(tnmb,'production_budget')
intnum(tnmb,'domestic_gross')
intnum(tnmb,'worldwide_gross')

,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,2009,Avatar,425000000,760507625,2776345279
1,2011,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,2019,Dark Phoenix,350000000,42762350,149762350
3,2015,Avengers: Age of Ultron,330600000,459005868,1403013963
4,2017,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
...,...,...,...,...,...
5777,2018,Red 11,7000,0,0
5778,1999,Following,6000,48482,240495
5779,2005,Return to the Land of Wonders,5000,1338,1338
5780,2015,A Plague So Pleasant,1400,0,0
5781,2005,My Date With Drew,1100,181041,181041

In [14]:
# See if any duplicates
tnmbduplicates = tnmb[tnmb.duplicated()]
tnmbduplicates

Empty DataFrame
Columns: [release_date, movie, production_budget, domestic_gross, worldwide_gross]
Index: []

In [15]:
#Rename columns
tnmb.columns = ['Release Year', 'Movie', 'Production Budget', 'Domestic Gross', 'Worldwide Gross']
tnmb

,Release Year,Movie,Production Budget,Domestic Gross,Worldwide Gross
0,2009,Avatar,425000000,760507625,2776345279
1,2011,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,2019,Dark Phoenix,350000000,42762350,149762350
3,2015,Avengers: Age of Ultron,330600000,459005868,1403013963
4,2017,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
...,...,...,...,...,...
5777,2018,Red 11,7000,0,0
5778,1999,Following,6000,48482,240495
5779,2005,Return to the Land of Wonders,5000,1338,1338
5780,2015,A Plague So Pleasant,1400,0,0
5781,2005,My Date With Drew,1100,181041,181041

In [16]:
tnmb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 5 columns):
Release Year         5782 non-null int64
Movie                5782 non-null object
Production Budget    5782 non-null int64
Domestic Gross       5782 non-null int64
Worldwide Gross      5782 non-null int64
dtypes: int64(4), object(1)
memory usage: 226.0+ KB

This dataframe is ready for the next section.

<p style="color:red">TBD: Additional Data - webs scraping to look at franchise</p>

## Additional data

<p style="color:red">Interested in franchises as many if not most have Movie element and way for Microsoft to utilise existing IP.
Introduce Wiki page</p>

### Web scraping

In [17]:
#Obtain details of highest grossing franchises
url = requests.get('https://en.wikipedia.org/wiki/List_of_highest-grossing_media_franchises')
soup = BeautifulSoup(url.content, 'html.parser')

# Look for tables on wikipedia page.
tables = list(soup.findAll('table', {'class':'wikitable sortable'}))
len(tables)

2

In [18]:
# Look at first table, franchises over $10 billion
table10bil = tables[0]

# Seperate each entry in the table - start as 1 as 0 is just header
entries = table10bil.findAll('tr')[1:]

# Investigate first entry
entry = entries[0]
name = entry.findAll('td')[1].text.strip()
revenue = entry.findAll('td')[3].text.strip().replace("\n","")
originalmedia = entry.findAll('td')[5].text.replace("\n","")
owner = entry.findAll('td')[7].text.replace("\n","")
print(f"Name: {name}, Revenue: {revenue}, Original media : {originalmedia}, Owner: {owner}")

Name: Pokémon, Revenue: est. $95 billion, Original media : Video game, Owner: Nintendo (trademark)  The Pokémon Company  (Nintendo, Game Freak, Creatures) (copyright)

In [19]:
# Create lists 
names = [entry.findAll('td')[1].text.strip() for entry in entries]
revenues = [entry.findAll('td')[3].text.strip().replace("\n","") for entry in entries]
originalmedias = [entry.findAll('td')[5].text.replace("\n","") for entry in entries]
owners = [entry.findAll('td')[7].text.replace("\n","") for entry in entries]

In [20]:
# Create dataframe from lists
df_franchisesover10b = pd.DataFrame([names, revenues, originalmedias, owners]).transpose()
df_franchisesover10b.columns = ['Name', 'Revenue', 'Original Media', 'Owner']
df_franchisesover10b.head()

,Name,Revenue,Original Media,Owner
0,Pokémon,est. $95 billion,Video game,Nintendo (trademark) The Pokémon Company (Ni...
1,Hello Kitty,est. $86 billion,Cartoon character[38],Sanrio
2,Winnie the Pooh,est. $76 billion,Book[59],The Walt Disney Company
3,Mickey Mouse & Friends,est. $74 billion,Animated cartoon,The Walt Disney Company
4,Star Wars,est. $70 billion,Film,Lucasfilm (The Walt Disney Company)

In [21]:
# Do the same process to extract the second table
table4bil = tables[1]

# Seperate each entry in the table - start as 1 as 0 is just header
entries = table4bil.findAll('tr')[1:]

# Investigate first entry
entry = entries[0]

#note indices 0,2,4,6  below are different as previous table had an additional index column
name = entry.findAll('td')[0].text.strip()
revenue = entry.findAll('td')[2].text.strip().replace("\n","")
originalmedia = entry.findAll('td')[4].text.replace("\n","")
owner = entry.findAll('td')[6].text.replace("\n","")
print(f"Name: {name}, Revenue: {revenue}, Original media : {originalmedia}, Owner: {owner}")

Name: Grand Theft Auto, Revenue: est. $9.99 billion, Original media : Video game, Owner: Rockstar Games  (Take-Two Interactive)

In [22]:
# Create lists 
names = [entry.findAll('td')[0].text.strip() for entry in entries]
revenues = [entry.findAll('td')[2].text.strip().replace("\n","") for entry in entries]
originalmedias = [entry.findAll('td')[4].text.replace("\n","") for entry in entries]
owners = [entry.findAll('td')[6].text.replace("\n","") for entry in entries]

In [23]:
# Create dataframe from lists
df_franchisesover4b = pd.DataFrame([names, revenues, originalmedias, owners]).transpose()
df_franchisesover4b.columns = ['Name', 'Revenue', 'Original Media', 'Owner']
df_franchisesover4b.head()

,Name,Revenue,Original Media,Owner
0,Grand Theft Auto,est. $9.99 billion,Video game,Rockstar Games (Take-Two Interactive)
1,JoJo's Bizarre Adventure,est. $9.8 billion,Manga,Hirohiko Araki Shueisha (Hitotsubashi Group) ...
2,Thomas & Friends,est. $9.48 billion,Book,Egmont Group Mattel
3,Lineage,est. $9.32 billion,Video game,NCSoft
4,Sesame Street (The Muppets),est. $9.19 billion,Television series,The Muppets Studio (The Walt Disney Company) ...

In [24]:
# Join both tables
df_franchises = df_franchisesover10b.append(df_franchisesover4b)
df_franchises.head()

,Name,Revenue,Original Media,Owner
0,Pokémon,est. $95 billion,Video game,Nintendo (trademark) The Pokémon Company (Ni...
1,Hello Kitty,est. $86 billion,Cartoon character[38],Sanrio
2,Winnie the Pooh,est. $76 billion,Book[59],The Walt Disney Company
3,Mickey Mouse & Friends,est. $74 billion,Animated cartoon,The Walt Disney Company
4,Star Wars,est. $70 billion,Film,Lucasfilm (The Walt Disney Company)

### Data cleaning

In [25]:
# Reset index
df_franchises = df_franchises.reset_index()
df_franchises = df_franchises.drop('index', axis = 1)
df_franchises

,Name,Revenue,Original Media,Owner
0,Pokémon,est. $95 billion,Video game,Nintendo (trademark) The Pokémon Company (Ni...
1,Hello Kitty,est. $86 billion,Cartoon character[38],Sanrio
2,Winnie the Pooh,est. $76 billion,Book[59],The Walt Disney Company
3,Mickey Mouse & Friends,est. $74 billion,Animated cartoon,The Walt Disney Company
4,Star Wars,est. $70 billion,Film,Lucasfilm (The Walt Disney Company)
...,...,...,...,...
105,The Hunger Games,est. $4.05 billion[ih],Novel,Scholastic Corporation Lionsgate
106,Magic: The Gathering,est. $4.02 billion,Card game,Wizards of the Coast (Hasbro)
107,Mission: Impossible,$4 billion[ij][572],Television series,Paramount Pictures
108,Strawberry Shortcake,est. $4 billion,Greeting card,American Greetings
109,Gran Turismo,est. $4 billion,Video game,Sony

In [26]:
# Transform revenue column into integer

In [27]:
microsoft_franchises = df_franchises [(df_franchises['Owner'] == 'Microsoft') | 
                                      (df_franchises['Owner'] == 'Microsoft Studios')]

In [28]:
microsoft_franchises

         Name             Revenue Original Media              Owner
71  Minecraft  est. $7.23 billion     Video game  Microsoft Studios
76       Halo   est. $6.5 billion     Video game          Microsoft

# Visualisations and Insights

## Movie industry trends

## Impact of budget

## Which genre?

## Runtime

## Release date

## Exploring franchises

# Conclusion and Future Work